Documents/data-structures/union-find.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-18 Wed 13:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Union Find</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yao Xiao" />
<link rel="stylesheet" type="text/css" href="../../static/css/reset.css" />
<link rel="stylesheet" type="text/css" href="../../static/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Union Find</h1>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffb86c;">#if</span><span style="color: #ffb86c;">n</span><span style="color: #ffb86c;">def</span> __UNION_FIND_H_INCLUDED__
<span style="color: #ffb86c;">#define</span> <span style="color: #f8f8f2;">__UNION_FIND_H_INCLUDED__</span>

<span style="color: #ffb86c;">#include</span> <span style="color: #f8f8f2;">&lt;</span><span style="color: #f1fa8c;">stdlib.h</span><span style="color: #f8f8f2;">&gt;</span>

<span style="color: #ff79c6; font-weight: bold;">struct</span> <span style="color: #bd93f9;">uf_t</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #bd93f9;">int</span> * <span style="color: #f8f8f2;">parent</span>; <span style="color: #6272a4;">// </span><span style="color: #6272a4;">1-based</span>
  <span style="color: #bd93f9;">int</span> * <span style="color: #f8f8f2;">weight</span>; <span style="color: #6272a4;">// </span><span style="color: #6272a4;">1-based</span>
<span style="color: #f8f8f2;">}</span>;
<span style="color: #ff79c6; font-weight: bold;">typedef</span> <span style="color: #ff79c6; font-weight: bold;">struct</span> <span style="color: #bd93f9;">uf_t</span> * <span style="color: #bd93f9;">uf_t</span>;

<span style="color: #bd93f9;">uf_t</span> <span style="color: #50fa7b; font-weight: bold;">uf_create</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">size</span><span style="color: #f8f8f2;">)</span>;
<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">uf_delete</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">uf_t</span> * <span style="color: #f8f8f2;">ptr</span><span style="color: #f8f8f2;">)</span>;
<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">uf_union</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">uf_t</span> <span style="color: #f8f8f2;">uf</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">i</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">j</span><span style="color: #f8f8f2;">)</span>;
<span style="color: #bd93f9;">int</span> <span style="color: #50fa7b; font-weight: bold;">uf_root</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">uf_t</span> <span style="color: #f8f8f2;">uf</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">i</span><span style="color: #f8f8f2;">)</span>;
<span style="color: #bd93f9;">int</span> <span style="color: #50fa7b; font-weight: bold;">uf_size</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">uf_t</span> <span style="color: #f8f8f2;">uf</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">i</span><span style="color: #f8f8f2;">)</span>;

<span style="color: #bd93f9;">uf_t</span> <span style="color: #50fa7b; font-weight: bold;">uf_create</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">size</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">i</span>;
  <span style="color: #ff79c6; font-weight: bold;">struct</span> <span style="color: #bd93f9;">uf_t</span> * <span style="color: #f8f8f2;">ptr</span> = malloc<span style="color: #8be9fd;">(</span><span style="color: #ff79c6; font-weight: bold;">sizeof</span><span style="color: #bd93f9;">(</span>*ptr<span style="color: #bd93f9;">)</span> + <span style="color: #ff79c6; font-weight: bold;">sizeof</span><span style="color: #bd93f9;">(</span><span style="color: #bd93f9;">int</span><span style="color: #bd93f9;">)</span> * <span style="color: #bd93f9;">(</span>size + <span style="color: #8be9fd;">1</span><span style="color: #bd93f9;">)</span> * <span style="color: #8be9fd;">2</span><span style="color: #8be9fd;">)</span>;
  ptr-&gt;parent = <span style="color: #8be9fd;">(</span><span style="color: #bd93f9;">int</span> *<span style="color: #8be9fd;">)</span> <span style="color: #8be9fd;">(</span>ptr + <span style="color: #8be9fd;">1</span><span style="color: #8be9fd;">)</span>;
  ptr-&gt;weight = ptr-&gt;parent + <span style="color: #8be9fd;">(</span>size + <span style="color: #8be9fd;">1</span><span style="color: #8be9fd;">)</span>;
  <span style="color: #ff79c6; font-weight: bold;">for</span> <span style="color: #8be9fd;">(</span>i = <span style="color: #8be9fd;">1</span>; i &lt;= size; i++<span style="color: #8be9fd;">)</span> <span style="color: #8be9fd;">{</span>
    ptr-&gt;parent<span style="color: #bd93f9;">[</span>i<span style="color: #bd93f9;">]</span> = i;
    ptr-&gt;weight<span style="color: #bd93f9;">[</span>i<span style="color: #bd93f9;">]</span> = <span style="color: #8be9fd;">1</span>;
  <span style="color: #8be9fd;">}</span>
  <span style="color: #ff79c6; font-weight: bold;">return</span> ptr;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">uf_delete</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">uf_t</span> * <span style="color: #f8f8f2;">ptr</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  free<span style="color: #8be9fd;">(</span>*ptr<span style="color: #8be9fd;">)</span>;
  *ptr = <span style="color: #8be9fd;">NULL</span>;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">int</span> <span style="color: #50fa7b; font-weight: bold;">uf_root</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">uf_t</span> <span style="color: #f8f8f2;">uf</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">i</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #ff79c6; font-weight: bold;">while</span> <span style="color: #8be9fd;">(</span>i != uf-&gt;parent<span style="color: #bd93f9;">[</span>i<span style="color: #bd93f9;">]</span><span style="color: #8be9fd;">)</span> <span style="color: #8be9fd;">{</span>
    uf-&gt;parent<span style="color: #bd93f9;">[</span>i<span style="color: #bd93f9;">]</span> = uf-&gt;parent<span style="color: #bd93f9;">[</span>uf-&gt;parent<span style="color: #ff79c6;">[</span>i<span style="color: #ff79c6;">]</span><span style="color: #bd93f9;">]</span>;
    i = uf-&gt;parent<span style="color: #bd93f9;">[</span>i<span style="color: #bd93f9;">]</span>;
  <span style="color: #8be9fd;">}</span>
  <span style="color: #ff79c6; font-weight: bold;">return</span> i;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">int</span> <span style="color: #50fa7b; font-weight: bold;">uf_size</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">uf_t</span> <span style="color: #f8f8f2;">uf</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">i</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  <span style="color: #ff79c6; font-weight: bold;">return</span> uf-&gt;weight<span style="color: #8be9fd;">[</span>uf_root<span style="color: #bd93f9;">(</span>uf, i<span style="color: #bd93f9;">)</span><span style="color: #8be9fd;">]</span>;
<span style="color: #f8f8f2;">}</span>

<span style="color: #bd93f9;">void</span> <span style="color: #50fa7b; font-weight: bold;">uf_union</span><span style="color: #f8f8f2;">(</span><span style="color: #bd93f9;">uf_t</span> <span style="color: #f8f8f2;">uf</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">i</span>, <span style="color: #bd93f9;">int</span> <span style="color: #f8f8f2;">j</span><span style="color: #f8f8f2;">)</span> <span style="color: #f8f8f2;">{</span>
  i = uf_root<span style="color: #8be9fd;">(</span>uf, i<span style="color: #8be9fd;">)</span>;
  j = uf_root<span style="color: #8be9fd;">(</span>uf, j<span style="color: #8be9fd;">)</span>;
  <span style="color: #ff79c6; font-weight: bold;">if</span> <span style="color: #8be9fd;">(</span>uf_size<span style="color: #bd93f9;">(</span>uf, i<span style="color: #bd93f9;">)</span> &gt; uf_size<span style="color: #bd93f9;">(</span>uf, j<span style="color: #bd93f9;">)</span><span style="color: #8be9fd;">)</span> <span style="color: #8be9fd;">{</span>
    uf-&gt;parent<span style="color: #bd93f9;">[</span>j<span style="color: #bd93f9;">]</span> = i;
    uf-&gt;weight<span style="color: #bd93f9;">[</span>i<span style="color: #bd93f9;">]</span> += uf-&gt;weight<span style="color: #bd93f9;">[</span>j<span style="color: #bd93f9;">]</span>;

  <span style="color: #8be9fd;">}</span> <span style="color: #ff79c6; font-weight: bold;">else</span> <span style="color: #8be9fd;">{</span>
    uf-&gt;parent<span style="color: #bd93f9;">[</span>i<span style="color: #bd93f9;">]</span> = j;
    uf-&gt;weight<span style="color: #bd93f9;">[</span>j<span style="color: #bd93f9;">]</span> += uf-&gt;weight<span style="color: #bd93f9;">[</span>i<span style="color: #bd93f9;">]</span>;
  <span style="color: #8be9fd;">}</span>
<span style="color: #f8f8f2;">}</span>

<span style="color: #ffb86c;">#endif</span> <span style="color: #6272a4;">// </span><span style="color: #6272a4;">__UNION_FIND_H_INCLUDED__</span>
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yao Xiao</p>
<p class="date">Created: 2019-12-18 Wed 13:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
